#include "comshead.h"
/********************************************
功能：搜索字符串右边起的第一个匹配字符
********************************************/
char* Rstrchr(char* s, char x)
{
    int i = strlen(s);
    if(!(*s))
    {
        return 0;
    }
    while(s[i-1])
    {
        if(strchr(s+(i-1), x))
        {
            return (s+(i-1));
        }
        else
        {
            i--;
        }
    }
    return 0;
}
/********************************************
功能：把字符串转换为全小写
********************************************/
void   ToLowerCase(char* s)
{
    while(*s && *s!='\0' )
    {
        *s=tolower(*s++);
    }
    *s = '\0';
}

